---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.MechanicalSystem
source: html/ef83dd58-07d6-4f9a-8dc6-f4b1fd8246d2.htm
---
# Autodesk.Revit.DB.Mechanical.MechanicalSystem

A mechanical system element.

## Syntax (C#)
```csharp
public class MechanicalSystem : MEPSystem
```